"""
Напишите программу, которая получает от пользователя два числа a и b и выводит значение выражения ab a ^ b ab.
Для возведения в степень в Python используется оператор **
"""
a, b = int(input()), int(input())
print(a ** b)
