"""
Для начала нужно написать программу, которая считывает строку и заменяет в ней группы пробельных символов на символ
подчёркивания.
"""

input_string = input().split()
print('_'.join(input_string))
